#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// TODO. Тестовая ошибка для сонара.
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДемоРасходнаяНакладнаяТовары.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ДемоРасходнаяНакладнаяТовары.Товар,
		|	ДемоРасходнаяНакладнаяТовары.Количество
		|ИЗ
		|	Документ.ДемоРасходнаяНакладная.Товары КАК ДемоРасходнаяНакладнаяТовары
		|ГДЕ
		|	ДемоРасходнаяНакладнаяТовары.Ссылка = &Ссылка";
		
	Движения.ДемоОстаткиТоваров.Записывать = Истина;
	Движения.ДемоОстаткиТоваров.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти