#Область ПрограммныйИнтерфейс

Процедура ОпределитьОбъектыСПоказателями(ОбъектыМетаданных) Экспорт
	
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ДемоНоменклатура);
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ДемоПоставщики);
	
КонецПроцедуры

Процедура ОпределитьТриггерыРасчетаПоказателей(ОбъектыМетаданных) Экспорт
	
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ДемоНоменклатура);
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ДемоПоставщики);
	ОбъектыМетаданных.Добавить(Метаданные.РегистрыСведений.ДемоШтрихкодыНоменклатуры);
	ОбъектыМетаданных.Добавить(Метаданные.РегистрыНакопления.ДемоОстаткиТоваров);
	
КонецПроцедуры

#КонецОбласти