#Область ПрограммныйИнтерфейс

// Определяет, какие объекты метаданных будут иметь показатели.
// 
// Параметры:
// 	ОбъектыМетаданных - Массив - Объекты метаданных.
Процедура ОпределитьОбъектыСПоказателями(ОбъектыМетаданных) Экспорт
	
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ДемоНоменклатура);
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ДемоПоставщики);
	
КонецПроцедуры

// Определяет, какие объекты метаданных могут являться триггерами для расчета показателей объектов.
// 
// Параметры:
// 	ОбъектыМетаданных - Массив - Объекты метаданых.
Процедура ОпределитьТриггерыРасчетаПоказателей(ОбъектыМетаданных) Экспорт
	
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ДемоНоменклатура);
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ДемоПоставщики);
	ОбъектыМетаданных.Добавить(Метаданные.РегистрыСведений.ДемоШтрихкодыНоменклатуры);
	ОбъектыМетаданных.Добавить(Метаданные.РегистрыНакопления.ДемоОстаткиТоваров);
	
КонецПроцедуры

#КонецОбласти