#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДемоПриходнаяНакладнаяТовары.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДемоПриходнаяНакладнаяТовары.Товар,
		|	ДемоПриходнаяНакладнаяТовары.Количество
		|ИЗ
		|	Документ.ДемоПриходнаяНакладная.Товары КАК ДемоПриходнаяНакладнаяТовары
		|ГДЕ
		|	ДемоПриходнаяНакладнаяТовары.Ссылка = &Ссылка";
		
	Движения.ДемоОстаткиТоваров.Записывать = Истина;
	Движения.ДемоОстаткиТоваров.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти